Revit 2018 API
BuiltInFailures.FabricationShapeFailures Class
 Failures about Fabrication shape generation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Syntax
C#
public static class FabricationShapeFailures
Visual Basic
Public NotInheritable Class FabricationShapeFailures
Visual C++
public ref class FabricationShapeFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.FabricationShapeFailures
See Also
BuiltInFailures.FabricationShapeFailures Members
Autodesk.Revit.DB Namespace